Revit 2026 API

# ElementGetParameter Method

---

Retrieves a parameter from the element given identifier.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Parameter GetParameter(
	ForgeTypeId parameterTypeId
)
```
```vb
Public Function GetParameter (
	parameterTypeId As ForgeTypeId
) As Parameter
```
```cpp
public:
Parameter^ GetParameter(
	ForgeTypeId^ parameterTypeId
)
```
```fsharp
member GetParameter :
        parameterTypeId : ForgeTypeId -> Parameter
```

#### Parameters

parameterTypeId ForgeTypeId
    Identifier of the built-in parameter.

#### Return Value

Parameter

| Exception | Condition |
| --- | --- |
| ArgumentException | parameterTypeId does not identify a built-in parameter. See Parameter.IsBuiltInParameter(ForgeTypeId) and Parameter.GetParameterTypeId(BuiltInParameter). |
| ArgumentNullException | A non-optional argument was NULL |

Parameters are a generic form of data storage within elements. The parameters are visible through the Autodesk Revit user interface in the Element Properties dialog. This method uses a built in parameter identifier to access the parameter. Autodesk Revit has a large number of built in parameters that are available via static properties.

#### Reference

Element Class

Autodesk.Revit.DB Namespace